USE defaultdb;
/*!50503 SET NAMES utf8mb4 */;
-- MySQL dump 10.13  Distrib 9.5.0, for Win64 (x86_64)
--
-- Host: localhost    Database: memory_devices_db
-- ------------------------------------------------------
-- Server version	9.5.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--


--
-- Table structure for table `full_tests`
--

DROP TABLE IF EXISTS `full_tests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `full_tests` (
  `id` int NOT NULL AUTO_INCREMENT,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_a` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_b` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_c` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_d` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `correct_answer` enum('A','B','C','D') COLLATE utf8mb4_unicode_ci NOT NULL,
  `topic_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `topic_id` (`topic_id`),
  CONSTRAINT `full_tests_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `theory_topics` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=121 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `full_tests`
--

LOCK TABLES `full_tests` WRITE;
/*!40000 ALTER TABLE `full_tests` DISABLE KEYS */;
INSERT INTO `full_tests` VALUES (91,'╨з╤В╨╛ ╨┐╤А╨╛╨╕╨╖╨╛╨╣╨┤╤С╤В ╤Б ╨┤╨░╨╜╨╜╤Л╨╝╨╕ ╨▓ ╨Ю╨Ч╨г ╨┐╤А╨╕ ╨╛╤В╨║╨╗╤О╤З╨╡╨╜╨╕╨╕ ╨┐╨╕╤В╨░╨╜╨╕╤П?','╨б╨╛╤Е╤А╨░╨╜╤П╤В╤Б╤П ╨╜╨░ ╨┤╨╕╤Б╨║╨╡','╨г╨┤╨░╨╗╤П╤В╤Б╤П','╨б╨╛╨╢╨╝╤Г╤В╤Б╤П','╨Ч╨░╤И╨╕╤Д╤А╤Г╤О╤В╤Б╤П','B',1),(92,'╨Ы╤О╨▒╨░╤П ╨┐╤А╨╛╨│╤А╨░╨╝╨╝╨░ ╨┐╨╡╤А╨╡╨┤ ╨╖╨░╨┐╤Г╤Б╨║╨╛╨╝ ╨╖╨░╨│╤А╤Г╨╢╨░╨╡╤В╤Б╤П:','╨б╤А╨░╨╖╤Г ╨▓ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А','╨б ╨╢╨╡╤Б╤В╨║╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░ ╨▓ ╨╛╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╤Г╤О ╨┐╨░╨╝╤П╤В╤М','╨Т ╨║╨╡╤И-╨┐╨░╨╝╤П╤В╤М','╨Т BIOS','B',1),(93,'╨Ъ╨░╨║╨╛╨╣ ╤Н╨╗╨╡╨╝╨╡╨╜╤В ╤П╨▓╨╗╤П╨╡╤В╤Б╤П ╤Н╨╗╨╡╨╝╨╡╨╜╤В╨░╤А╨╜╨╛╨╣ ╤П╤З╨╡╨╣╨║╨╛╨╣ ╨┐╨░╨╝╤П╤В╨╕ ╨▓ ╤З╨╕╨┐╨╡ ╨Ю╨Ч╨г?','╨в╤А╨░╨╜╨╖╨╕╤Б╤В╨╛╤А','╨Ъ╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А','╨а╨╡╨╖╨╕╤Б╤В╨╛╤А','╨Ш╨╜╨┤╤Г╨║╤В╨╕╨▓╨╜╨╛╤Б╤В╤М','B',1),(94,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╨╝╨╛╨┤╤Г╨╗╤М ╨┐╨░╨╝╤П╤В╨╕?','╨Х╨┤╨╕╨╜╤Б╤В╨▓╨╡╨╜╨╜╨░╤П ╨╝╨╕╨║╤А╨╛╤Б╤Е╨╡╨╝╨░ ╨Ч╨г ╨╕╨╗╨╕ ╤Б╨╛╨▓╨╛╨║╤Г╨┐╨╜╨╛╤Б╤В╤М ╨╛╨▒╤К╨╡╨┤╨╕╨╜╤С╨╜╨╜╤Л╤Е ╨Ш╨Ь╨б','╨Я╤А╨╛╨│╤А╨░╨╝╨╝╨░ ╤Г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╤П ╨┐╨░╨╝╤П╤В╤М╤О','╨а╨░╨╖╨┤╨╡╨╗ ╨╜╨░ ╨╢╤С╤Б╤В╨║╨╛╨╝ ╨┤╨╕╤Б╨║╨╡','╨в╨╕╨┐ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨░','A',1),(95,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╨▒╨░╨╜╨║ ╨┐╨░╨╝╤П╤В╨╕?','╨Ю╨┤╨╕╨╜ ╨╝╨╛╨┤╤Г╨╗╤М ╨┐╨░╨╝╤П╤В╨╕','╨Ю╨┤╨╕╨╜ ╨╕╨╗╨╕ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╛ ╨╝╨╛╨┤╤Г╨╗╨╡╨╣ ╨┐╨░╨╝╤П╤В╨╕','╨а╨░╨╖╨┤╨╡╨╗ ╤А╨╡╨╡╤Б╤В╤А╨░ Windows','╨Ъ╤Н╤И-╨┐╨░╨╝╤П╤В╤М ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨░','B',1),(96,'╨Т ╤З╤С╨╝ ╤Б╤Г╤В╤М ╤А╨░╤Б╤Б╨╗╨╛╨╡╨╜╨╕╤П ╨┐╨░╨╝╤П╤В╨╕?','╨г╨┤╨░╨╗╨╡╨╜╨╕╨╡ ╨╜╨╡╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╤Л╤Е ╨▒╨░╨╜╨║╨╛╨▓','╨Ю╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╤Л╨╣ ╨┤╨╛╤Б╤В╤Г╨┐ ╨║╨╛ ╨╝╨╜╨╛╨│╨╕╨╝ ╨▒╨░╨╜╨║╨░╨╝ ╨┐╨░╨╝╤П╤В╨╕ ╨┤╨╗╤П ╤Г╤Б╨║╨╛╤А╨╡╨╜╨╕╤П','╨а╨░╨╖╨┤╨╡╨╗╨╡╨╜╨╕╨╡ ╨┐╨░╨╝╤П╤В╨╕ ╨╜╨░ ╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╨╡ ╤А╨░╨╖╨┤╨╡╨╗╤Л','╨Ъ╨╛╨┐╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨┤╨░╨╜╨╜╤Л╤Е ╨╝╨╡╨╢╨┤╤Г ╨▒╨░╨╜╨║╨░╨╝╨╕','B',1),(97,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╤З╨╡╤А╨╡╨┤╨╛╨▓╨░╨╜╨╕╨╡ ╨░╨┤╤А╨╡╤Б╨╛╨▓ (address interleaving)?','╨б╨╗╤Г╤З╨░╨╣╨╜╨╛╨╡ ╤А╨░╤Б╨┐╤А╨╡╨┤╨╡╨╗╨╡╨╜╨╕╨╡ ╨░╨┤╤А╨╡╤Б╨╛╨▓','╨Ш╨╖╨╝╨╡╨╜╨╡╨╜╨╕╨╡ ╤Б╨╕╤Б╤В╨╡╨╝╤Л ╤А╨░╤Б╨┐╤А╨╡╨┤╨╡╨╗╨╡╨╜╨╕╤П ╨░╨┤╤А╨╡╤Б╨╛╨▓ ╨╝╨╡╨╢╨┤╤Г ╨▒╨░╨╜╨║╨░╨╝╨╕ ╨┐╨░╨╝╤П╤В╨╕','╨и╨╕╤Д╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨░╨┤╤А╨╡╤Б╨╛╨▓','╨г╨┤╨░╨╗╨╡╨╜╨╕╨╡ ╨┤╤Г╨▒╨╗╨╕╨║╨░╤В╨╛╨▓ ╨░╨┤╤А╨╡╤Б╨╛╨▓','B',1),(98,'╨з╤В╨╛ ╨▓╤Е╨╛╨┤╨╕╤В ╨▓ ╤П╨┤╤А╨╛ ╨╝╨╕╨║╤А╨╛╤Б╤Е╨╡╨╝╤Л ╨┐╨░╨╝╤П╤В╨╕?','╨в╨╛╨╗╤М╨║╨╛ ╨║╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╤Л','╨б╨╛╨▓╨╛╨║╤Г╨┐╨╜╨╛╤Б╤В╤М ╨Ч╨н ╨╕ ╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╤Е ╤Б╤Е╨╡╨╝ ╨▓╤Л╨▒╨╛╤А╨░ ╤Б╤В╤А╨╛╨║ ╨╕ ╤Б╤В╨╛╨╗╨▒╤Ж╨╛╨▓','╨в╨╛╨╗╤М╨║╨╛ ╨┤╨╡╤И╨╕╤Д╤А╨░╤В╨╛╤А╤Л','╨в╨╛╨╗╤М╨║╨╛ ╤А╨╡╨│╨╕╤Б╤В╤А╤Л','B',1),(99,'╨Ъ╨░╨║╨╛╨▓╨░ ╨╛╤Б╨╜╨╛╨▓╨╜╨░╤П ╤Д╤Г╨╜╨║╤Ж╨╕╤П ╨║╨╡╤И-╨┐╨░╨╝╤П╤В╨╕?','╨Ф╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨╡ ╤Е╤А╨░╨╜╨╡╨╜╨╕╨╡','╨Т╤А╨╡╨╝╨╡╨╜╨╜╨╛╨╡ ╤Е╤А╨░╨╜╨╡╨╜╨╕╨╡ ╤З╨░╤Б╤В╨╛ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╤Л╤Е ╨┤╨░╨╜╨╜╤Л╤Е ╨▒╨╗╨╕╨╢╨╡ ╨║ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╤Г','╨Ч╨░╤Й╨╕╤В╨░ ╨╛╤В ╨▓╨╕╤А╤Г╤Б╨╛╨▓','╨г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╨╡ ╨┐╨╕╤В╨░╨╜╨╕╨╡╨╝','B',2),(100,'╨Я╤А╨╕ ╨╝╨╡╤В╨╛╨┤╨╡ write-through ╨╖╨░╨┐╨╕╤Б╤М ╨┐╤А╨╛╨╕╤Б╤Е╨╛╨┤╨╕╤В:','╨в╨╛╨╗╤М╨║╨╛ ╨▓ ╨║╨╡╤И','╨в╨╛╨╗╤М╨║╨╛ ╨▓ ╨Ю╨Ч╨г','╨Ю╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛ ╨▓ ╨Ю╨Ч╨г ╨╕ ╨▓ ╨║╨╡╤И','╨Т ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А','C',2),(101,'╨Я╤А╨╕ ╨╝╨╡╤В╨╛╨┤╨╡ write-back ╨╖╨░╨┐╨╕╤Б╤М ╨┐╤А╨╛╨╕╤Б╤Е╨╛╨┤╨╕╤В:','╨в╨╛╨╗╤М╨║╨╛ ╨▓ ╨Ю╨Ч╨г','╨б╨╜╨░╤З╨░╨╗╨░ ╨▓ ╨║╨╡╤И, ╨╖╨░╤В╨╡╨╝ ╨┐╤А╨╕ ╤Г╤Б╨╗╨╛╨▓╨╕╤П╤Е тАФ ╨▓ ╨Ю╨Ч╨г','╨Ю╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛ ╨▓ ╨Ю╨Ч╨г ╨╕ ╨║╨╡╤И','╨в╨╛╨╗╤М╨║╨╛ ╨╜╨░ ╨┤╨╕╤Б╨║','B',2),(102,'╨Т ╨║╨╡╤И╨╡ ╤Б ╨┐╤А╤П╨╝╤Л╨╝ ╨╛╤В╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╨╡╨╝:','╨Ы╤О╨▒╨╛╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨░╤Б╤Б╨╛╤Ж╨╕╨╕╤А╤Г╨╡╤В╤Б╤П ╤Б ╨╗╤О╨▒╤Л╨╝ ╤Г╤З╨░╤Б╤В╨║╨╛╨╝ ╨Ю╨Ч╨г','╨Ю╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╛╤В╨▓╨╡╤З╨░╨╡╤В ╨╖╨░ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨Ю╨Ч╨г','╨Ъ╨╡╤И ╤А╨░╨╖╨┤╨╡╨╗╤С╨╜ ╨╜╨░ ╨╜╨░╨▒╨╛╤А╤Л','╨Э╨╡╤В ╨┐╤А╨╕╨▓╤П╨╖╨║╨╕ ╨║ ╨Ю╨Ч╨г','B',2),(103,'╨б╨╝╨╡╤И╨░╨╜╨╜╤Л╨╣ ╨║╨╡╤И тАФ ╤Н╤В╨╛:','╨Ъ╨╡╤И ╤Б ╨┐╤А╤П╨╝╤Л╨╝ ╨╛╤В╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╨╡╨╝','╨Я╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣ ╨║╨╡╤И','╨Э╨░╨▒╨╛╤А╨╜╨╛-╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣ ╨║╨╡╤И','╨Т╨╕╤А╤В╤Г╨░╨╗╤М╨╜╤Л╨╣ ╨║╨╡╤И','C',2),(104,'╨Т ╨┐╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╨╛╨╝ ╨║╨╡╤И╨╡:','╨Ю╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨┐╤А╨╕╨▓╤П╨╖╨░╨╜ ╨║ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╨╛╨╝╤Г ╤Г╤З╨░╤Б╤В╨║╤Г ╨Ю╨Ч╨г','╨Ы╤О╨▒╨╛╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╝╨╛╨╢╨╡╤В ╨░╤Б╤Б╨╛╤Ж╨╕╨╕╤А╨╛╨▓╨░╤В╤М╤Б╤П ╤Б ╨╗╤О╨▒╤Л╨╝ ╤Г╤З╨░╤Б╤В╨║╨╛╨╝ ╨Ю╨Ч╨г','╨Ф╨░╨╜╨╜╤Л╨╡ ╨┤╤Г╨▒╨╗╨╕╤А╤Г╤О╤В╤Б╤П','╨Ъ╨╡╤И ╨╜╨╡╨┤╨╛╤Б╤В╤Г╨┐╨╡╨╜ ╨┤╨╗╤П ╨╖╨░╨┐╨╕╤Б╨╕','B',2),(105,'╨Ъ╨░╨║╨╛╨╣ ╤В╨╕╨┐ ╨║╨╡╤И╨░ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨▓ ╨▒╨╛╨╗╤М╤И╨╕╨╜╤Б╤В╨▓╨╡ ╤Б╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╤Л╤Е ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨╛╨▓?','╨б ╨┐╤А╤П╨╝╤Л╨╝ ╨╛╤В╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╨╡╨╝','╨Я╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣','╨б╨╝╨╡╤И╨░╨╜╨╜╤Л╨╣ (╨╜╨░╨▒╨╛╤А╨╜╨╛-╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣)','╨Т╨╜╨╡╤И╨╜╨╕╨╣ ╨║╨╡╤И','C',2),(106,'╨Ъ╨░╨║╨╛╨╡ ╤Г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛ ╨╛╤В╨╜╨╛╤Б╨╕╤В╤Б╤П ╨║ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤П╨╝?','╨Я╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А','╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М','╨Ц╤С╤Б╤В╨║╨╕╨╣ ╨┤╨╕╤Б╨║ (HDD)','╨Т╨╕╨┤╨╡╨╛╨║╨░╤А╤В╨░','C',3),(107,'╨Ъ╨░╨║╨╛╨╣ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤М ╨╜╨╡ ╨╕╨╝╨╡╨╡╤В ╨┤╨▓╨╕╨╢╤Г╤Й╨╕╤Е╤Б╤П ╨╝╨╡╤Е╨░╨╜╨╕╤З╨╡╤Б╨║╨╕╤Е ╤З╨░╤Б╤В╨╡╨╣?','HDD','CD-ROM','SSD','DVD-╨┐╤А╨╕╨▓╨╛╨┤','C',3),(108,'╨Э╨░ ╨║╨░╨║╨╛╨╝ ╨┐╤А╨╕╨╜╤Ж╨╕╨┐╨╡ ╨╛╤Б╨╜╨╛╨▓╨░╨╜╨░ ╤А╨░╨▒╨╛╤В╨░ HDD?','╨Ю╨┐╤В╨╕╤З╨╡╤Б╨║╨░╤П ╨╖╨░╨┐╨╕╤Б╤М','╨Ь╨░╨│╨╜╨╕╤В╨╜╨░╤П ╨╖╨░╨┐╨╕╤Б╤М ╨╜╨░ ╨▓╤А╨░╤Й╨░╤О╤Й╨╕╨╡╤Б╤П ╨┐╨╗╨░╤Б╤В╨╕╨╜╤Л','╨н╨╗╨╡╨║╤В╤А╨╕╤З╨╡╤Б╨║╨░╤П ╨╖╨░╨┐╨╕╤Б╤М','╨Ы╨░╨╖╨╡╤А╨╜╨░╤П ╨╖╨░╨┐╨╕╤Б╤М','B',3),(109,'╨Ъ╨░╨║╨╛╨╡ ╨┐╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨╛ SSD ╨┐╨╡╤А╨╡╨┤ HDD?','╨С╨╛╨╗╤М╤И╨░╤П ╤С╨╝╨║╨╛╤Б╤В╤М ╨┐╤А╨╕ ╤В╨╛╨╣ ╨╢╨╡ ╤Ж╨╡╨╜╨╡','╨Ю╤В╤Б╤Г╤В╤Б╤В╨▓╨╕╨╡ ╨┤╨▓╨╕╨╢╤Г╤Й╨╕╤Е╤Б╤П ╤З╨░╤Б╤В╨╡╨╣, ╨▓╤Л╤Б╨╛╨║╨░╤П ╤Б╨║╨╛╤А╨╛╤Б╤В╤М','╨Т╨╛╨╖╨╝╨╛╨╢╨╜╨╛╤Б╤В╤М ╨╝╨╜╨╛╨│╨╛╨║╤А╨░╤В╨╜╨╛╨╣ ╨┐╨╡╤А╨╡╨╖╨░╨┐╨╕╤Б╨╕','╨С╨╛╨╗╤М╤И╨░╤П ╨╜╨░╨┤╤С╨╢╨╜╨╛╤Б╤В╤М ╨╖╨░╨┐╨╕╤Б╨╕','B',3),(110,'╨Ъ╨░╨║╨╛╨╣ ╤В╨╕╨┐ ╨╛╨┐╤В╨╕╤З╨╡╤Б╨║╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░ ╨╕╨╝╨╡╨╡╤В ╨╜╨░╨╕╨▒╨╛╨╗╤М╤И╤Г╤О ╤С╨╝╨║╨╛╤Б╤В╤М?','CD','DVD','Blu-ray','VCD','C',3),(111,'╨Ъ╨░╨║╨╛╨╣ ╨┐╨░╤А╨░╨╝╨╡╤В╤А HDD ╨╕╨╖╨╝╨╡╤А╤П╨╡╤В╤Б╤П ╨▓ ╨╛╨▒/╨╝╨╕╨╜?','╨Б╨╝╨║╨╛╤Б╤В╤М','╨б╨║╨╛╤А╨╛╤Б╤В╤М ╨▓╤А╨░╤Й╨╡╨╜╨╕╤П ╨┐╨╗╨░╤Б╤В╨╕╨╜','╨а╨░╨╖╨╝╨╡╤А ╨║╨╡╤И╨░','╨в╨╛╨╗╤Й╨╕╨╜╨░ ╨┐╨╗╨░╤Б╤В╨╕╨╜╤Л','B',3),(112,'╨Ъ╨░╨║╨╛╨╣ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤М ╤П╨▓╨╗╤П╨╡╤В╤Б╤П ╤Н╨╜╨╡╤А╨│╨╛╨╜╨╡╨╖╨░╨▓╨╕╤Б╨╕╨╝╤Л╨╝?','╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М','╨Ъ╨╡╤И-╨┐╨░╨╝╤П╤В╤М','SSD','╨а╨╡╨│╨╕╤Б╤В╤А╤Л ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨░','C',3),(113,'╨Т ╨║╨░╨║╨╛╨╝ ╨│╨╛╨┤╤Г ╨▒╤Л╨╗╨░ ╨┐╤А╨╡╨┤╤Б╤В╨░╨▓╨╗╨╡╨╜╨░ ╤В╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤П RAID?','1977','1987','1997','2007','B',4),(114,'╨Ъ╤В╨╛ ╨┐╤А╨╡╨┤╤Б╤В╨░╨▓╨╕╨╗ ╨╛╤Д╨╕╤Ж╨╕╨░╨╗╤М╨╜╤Г╤О ╨║╨╛╨╜╤Ж╨╡╨┐╤Ж╨╕╤О RAID?','╨Ш╤Б╤Б╨╗╨╡╨┤╨╛╨▓╨░╤В╨╡╨╗╨╕ ╨╕╨╖ MIT','╨Ш╤Б╤Б╨╗╨╡╨┤╨╛╨▓╨░╤В╨╡╨╗╨╕ ╨╕╨╖ ╨Ъ╨░╨╗╨╕╤Д╨╛╤А╨╜╨╕╨╣╤Б╨║╨╛╨│╨╛ ╤Г╨╜╨╕╨▓╨╡╤А╤Б╨╕╤В╨╡╤В╨░ ╨▓ ╨С╨╡╤А╨║╨╗╨╕','╨Ш╤Б╤Б╨╗╨╡╨┤╨╛╨▓╨░╤В╨╡╨╗╨╕ ╨╕╨╖ ╨б╤В╤Н╨╜╤Д╨╛╤А╨┤╨░','╨Ш╨╜╨╢╨╡╨╜╨╡╤А╤Л ╨║╨╛╨╝╨┐╨░╨╜╨╕╨╕ Intel','B',4),(115,'╨Ъ╨░╨║ ╤А╨░╨▒╨╛╤В╨░╨╡╤В RAID 0?','╨Ф╨░╨╜╨╜╤Л╨╡ ╨┤╤Г╨▒╨╗╨╕╤А╤Г╤О╤В╤Б╤П ╨╜╨░ ╨║╨░╨╢╨┤╨╛╨╝ ╨┤╨╕╤Б╨║╨╡','╨Ф╨░╨╜╨╜╤Л╨╡ ╤А╨░╨╖╨▒╨╕╨▓╨░╤О╤В╤Б╤П ╨╜╨░ ╨▒╨╗╨╛╨║╨╕ ╨╕ ╨╖╨░╨┐╨╕╤Б╤Л╨▓╨░╤О╤В╤Б╤П ╨╜╨░ ╤А╨░╨╖╨╜╤Л╨╡ ╨┤╨╕╤Б╨║╨╕','╨Ф╨░╨╜╨╜╤Л╨╡ ╤Б╨╢╨╕╨╝╨░╤О╤В╤Б╤П','╨Ф╨░╨╜╨╜╤Л╨╡ ╤И╨╕╤Д╤А╤Г╤О╤В╤Б╤П','B',4),(116,'╨з╤В╨╛ ╨┐╤А╨╛╨╕╨╖╨╛╨╣╨┤╤С╤В ╤Б ╨┤╨░╨╜╨╜╤Л╨╝╨╕ RAID 0 ╨┐╤А╨╕ ╨╛╤В╨║╨░╨╖╨╡ ╨╛╨┤╨╜╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░?','╨Ь╨░╤Б╤Б╨╕╨▓ ╨┐╤А╨╛╨┤╨╛╨╗╨╢╨╕╤В ╤А╨░╨▒╨╛╤В╤Г','╨Я╨╛╤В╨╡╤А╤П╤О╤В╤Б╤П ╤В╨╛╨╗╤М╨║╨╛ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╜╨░ ╤Н╤В╨╛╨╝ ╨┤╨╕╤Б╨║╨╡','╨Я╨╛╤В╨╡╤А╤П╤О╤В╤Б╤П ╨▓╤Б╨╡ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╝╨░╤Б╤Б╨╕╨▓╨░','╨Э╨╕╤З╨╡╨│╨╛ ╨╜╨╡ ╨┐╤А╨╛╨╕╨╖╨╛╨╣╨┤╤С╤В','C',4),(117,'╨Ъ╨░╨║ ╨╕╨╜╨░╤З╨╡ ╨╜╨░╨╖╤Л╨▓╨░╨╡╤В╤Б╤П RAID 1?','Striping','Mirroring (╨╖╨╡╤А╨║╨░╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡)','Parity','Spanning','B',4),(118,'╨Ъ╨░╨║╨╛╨╣ ╨╛╤Б╨╜╨╛╨▓╨╜╨╛╨╣ ╨╜╨╡╨┤╨╛╤Б╤В╨░╤В╨╛╨║ RAID 1?','╨Ю╤В╤Б╤Г╤В╤Б╤В╨▓╨╕╨╡ ╨╛╤В╨║╨░╨╖╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╨╕','100% ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╤Б╤В╤М тАФ ╨▓╤Л╤Б╨╛╨║╨░╤П ╤Б╤В╨╛╨╕╨╝╨╛╤Б╤В╤М ╨╜╨░ ╨╡╨┤╨╕╨╜╨╕╤Ж╤Г ╨╛╨▒╤К╤С╨╝╨░','╨б╨╗╨╛╨╢╨╜╨╛╤Б╤В╤М ╤А╨╡╨░╨╗╨╕╨╖╨░╤Ж╨╕╨╕','╨Э╨╕╨╖╨║╨░╤П ╨╜╨░╨┤╤С╨╢╨╜╨╛╤Б╤В╤М','B',4),(119,'╨Ъ╨░╨║╨╛╨╡ ╨┐╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨╛ RAID 0?','╨Ю╤В╨║╨░╨╖╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╤М','╨Ч╨╡╤А╨║╨░╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨┤╨░╨╜╨╜╤Л╤Е','╨Э╨░╨╕╨▓╤Л╤Б╤И╨░╤П ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╤М ╨┤╨╗╤П ╨▒╨╛╨╗╤М╤И╨╕╤Е ╨╛╨▒╤К╤С╨╝╨╛╨▓','╨Я╤А╨╛╤Б╤В╨╛╤В╨░ ╨▓╨╛╤Б╤Б╤В╨░╨╜╨╛╨▓╨╗╨╡╨╜╨╕╤П','C',4),(120,'╨Ш╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╨╜╨╕╨╡ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╤Е ╨║╨░╨╜╨░╨╗╨╛╨▓ ╨┐╨╡╤А╨╡╨┤╨░╤З╨╕ ╨┤╨░╨╜╨╜╤Л╤Е ╨▓ RAID:','╨г╨╝╨╡╨╜╤М╤И╨░╨╡╤В ╨╜╨░╨┤╤С╨╢╨╜╨╛╤Б╤В╤М','╨г╨▓╨╡╨╗╨╕╤З╨╕╨▓╨░╨╡╤В ╨┐╤А╨╛╨┐╤Г╤Б╨║╨╜╤Г╤О ╤Б╨┐╨╛╤Б╨╛╨▒╨╜╨╛╤Б╤В╤М ╤Б╨╕╤Б╤В╨╡╨╝╤Л','╨Э╨╡ ╨▓╨╗╨╕╤П╨╡╤В ╨╜╨░ ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╤М','╨г╨╝╨╡╨╜╤М╤И╨░╨╡╤В ╤С╨╝╨║╨╛╤Б╤В╤М','B',4);
/*!40000 ALTER TABLE `full_tests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `groups`
--

DROP TABLE IF EXISTS `groups`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `groups` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `groups`
--

LOCK TABLES `groups` WRITE;
/*!40000 ALTER TABLE `groups` DISABLE KEYS */;
INSERT INTO `groups` VALUES (1,'╨Ш╨б-101'),(2,'╨Ш╨б-102'),(3,'╨Ш╨б-201'),(4,'╨Ш╨б-202'),(5,'╨Ш╨б-301');
/*!40000 ALTER TABLE `groups` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `mini_tests`
--

DROP TABLE IF EXISTS `mini_tests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `mini_tests` (
  `id` int NOT NULL AUTO_INCREMENT,
  `topic_id` int NOT NULL,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_a` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_b` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_c` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_d` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `correct_answer` enum('A','B','C','D') COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  KEY `topic_id` (`topic_id`),
  CONSTRAINT `mini_tests_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `theory_topics` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mini_tests`
--

LOCK TABLES `mini_tests` WRITE;
/*!40000 ALTER TABLE `mini_tests` DISABLE KEYS */;
INSERT INTO `mini_tests` VALUES (77,1,'╨Ф╨╗╤П ╤З╨╡╨│╨╛ ╨┐╤А╨╡╨┤╨╜╨░╨╖╨╜╨░╤З╨╡╨╜╨░ ╨╛╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М?','╨Ф╨╗╤П ╨┤╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╤Д╨░╨╣╨╗╨╛╨▓','╨Ф╨╗╤П ╤А╨░╨▒╨╛╤В╤Л ╨Ю╨б ╨╕ ╨┐╤А╨╕╨╗╨╛╨╢╨╡╨╜╨╕╨╣, ╨╛╨▒╤А╨░╨▒╨╛╤В╨║╨╕ ╨╕ ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╨┤╨░╨╜╨╜╤Л╤Е','╨Ф╨╗╤П ╨┐╨╛╨┤╨║╨╗╤О╤З╨╡╨╜╨╕╤П ╨║ ╤Б╨╡╤В╨╕','╨Ф╨╗╤П ╨▓╤Л╨▓╨╛╨┤╨░ ╨╕╨╖╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╤П ╨╜╨░ ╨╝╨╛╨╜╨╕╤В╨╛╤А','B'),(78,1,'╨з╤В╨╛ ╨┐╤А╨╛╨╕╤Б╤Е╨╛╨┤╨╕╤В ╤Б ╨┤╨░╨╜╨╜╤Л╨╝╨╕ ╨▓ ╨Ю╨Ч╨г ╨┐╤А╨╕ ╨▓╤Л╨║╨╗╤О╤З╨╡╨╜╨╕╨╕ ╨┐╨╕╤В╨░╨╜╨╕╤П?','╨б╨╛╤Е╤А╨░╨╜╤П╤О╤В╤Б╤П ╨╜╨░╨▓╤Б╨╡╨│╨┤╨░','╨б╨╢╨╕╨╝╨░╤О╤В╤Б╤П','╨г╨┤╨░╨╗╤П╤О╤В╤Б╤П','╨Р╤А╤Е╨╕╨▓╨╕╤А╤Г╤О╤В╤Б╤П','C'),(79,1,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╤А╨╡╨│╨╡╨╜╨╡╤А╨░╤Ж╨╕╤П ╨┤╨░╨╜╨╜╤Л╤Е ╨▓ ╤З╨╕╨┐╨╡ ╨┐╨░╨╝╤П╤В╨╕?','╨г╨┤╨░╨╗╨╡╨╜╨╕╨╡ ╤Б╤В╨░╤А╤Л╤Е ╨┤╨░╨╜╨╜╤Л╤Е','╨Т╨╛╤Б╤Б╤В╨░╨╜╨╛╨▓╨╗╨╡╨╜╨╕╨╡ ╨╖╨░╤А╤П╨┤╨░ ╨║╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╨╛╨▓','╨Ъ╨╛╨┐╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨╜╨░ ╨┤╨╕╤Б╨║','╨и╨╕╤Д╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╨╕','B'),(80,1,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╤А╨░╤Б╤Б╨╗╨╛╨╡╨╜╨╕╨╡ ╨┐╨░╨╝╤П╤В╨╕?','╨г╨┤╨░╨╗╨╡╨╜╨╕╨╡ ╨╜╨╡╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╤Л╤Е ╨▒╨░╨╜╨║╨╛╨▓','╨Ю╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╤Л╨╣ ╨┤╨╛╤Б╤В╤Г╨┐ ╨║╨╛ ╨╝╨╜╨╛╨│╨╕╨╝ ╨▒╨░╨╜╨║╨░╨╝ ╨┐╨░╨╝╤П╤В╨╕ ╨┤╨╗╤П ╤Г╤Б╨║╨╛╤А╨╡╨╜╨╕╤П','╨а╨░╨╖╨┤╨╡╨╗╨╡╨╜╨╕╨╡ ╨┐╨░╨╝╤П╤В╨╕ ╨╜╨░ ╤А╨░╨╖╨┤╨╡╨╗╤Л','╨б╨╢╨░╤В╨╕╨╡ ╨┤╨░╨╜╨╜╤Л╤Е ╨▓ ╨Ю╨Ч╨г','B'),(81,2,'╨Ф╨╗╤П ╤З╨╡╨│╨╛ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨║╨╡╤И-╨┐╨░╨╝╤П╤В╤М?','╨Ф╨╗╤П ╨┤╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П','╨Ф╨╗╤П ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╤З╨░╤Б╤В╨╛ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╤Л╤Е ╨┤╨░╨╜╨╜╤Л╤Е ╨▒╨╗╨╕╨╢╨╡ ╨║ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╤Г','╨Ф╨╗╤П ╨┐╨╛╨┤╨║╨╗╤О╤З╨╡╨╜╨╕╤П ╨┐╨╡╤А╨╕╤Д╨╡╤А╨╕╨╕','╨Ф╨╗╤П ╨╛╤Е╨╗╨░╨╢╨┤╨╡╨╜╨╕╤П ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨░','B'),(82,2,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╨╝╨╡╤В╨╛╨┤ write-back?','╨Ч╨░╨┐╨╕╤Б╤М ╨╛╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛ ╨▓ ╨Ю╨Ч╨г ╨╕ ╨║╨╡╤И','╨Ч╨░╨┐╨╕╤Б╤М ╤Б╨╜╨░╤З╨░╨╗╨░ ╨▓ ╨║╨╡╤И, ╨╖╨░╤В╨╡╨╝ ╨┐╤А╨╕ ╤Г╤Б╨╗╨╛╨▓╨╕╤П╤Е тАФ ╨▓ ╨Ю╨Ч╨г','╨Ч╨░╨┐╨╕╤Б╤М ╤В╨╛╨╗╤М╨║╨╛ ╨▓ ╨Ю╨Ч╨г','╨г╨┤╨░╨╗╨╡╨╜╨╕╨╡ ╨┤╨░╨╜╨╜╤Л╤Е ╨╕╨╖ ╨║╨╡╤И╨░','B'),(83,2,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╨┐╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣ ╨║╨╡╤И?','╨Ы╤О╨▒╨╛╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╝╨╛╨╢╨╡╤В ╨░╤Б╤Б╨╛╤Ж╨╕╨╕╤А╨╛╨▓╨░╤В╤М╤Б╤П ╤Б ╨╗╤О╨▒╤Л╨╝ ╤Г╤З╨░╤Б╤В╨║╨╛╨╝ ╨Ю╨Ч╨г','╨Ю╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╛╤В╨▓╨╡╤З╨░╨╡╤В ╨╖╨░ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨Ю╨Ч╨г','╨Ъ╨╡╤И ╤А╨░╨╖╨┤╨╡╨╗╤С╨╜ ╨╜╨░ ╨╜╨░╨▒╨╛╤А╤Л','╨Ъ╨╡╤И ╤А╨░╨▒╨╛╤В╨░╨╡╤В ╤В╨╛╨╗╤М╨║╨╛ ╨┐╤А╨╕ ╨╖╨░╨│╤А╤Г╨╖╨║╨╡','A'),(84,2,'╨Ъ╨░╨║╨╛╨╣ ╤В╨╕╨┐ ╨║╨╡╤И╨░ ╤П╨▓╨╗╤П╨╡╤В╤Б╤П ╨║╨╛╨╝╨┐╤А╨╛╨╝╨╕╤Б╤Б╨╜╤Л╨╝ ╨▓╨░╤А╨╕╨░╨╜╤В╨╛╨╝?','╨Ъ╨╡╤И ╤Б ╨┐╤А╤П╨╝╤Л╨╝ ╨╛╤В╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╨╡╨╝','╨Я╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣ ╨║╨╡╤И','╨б╨╝╨╡╤И╨░╨╜╨╜╤Л╨╣ (╨╜╨░╨▒╨╛╤А╨╜╨╛-╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣) ╨║╨╡╤И','╨Т╨╕╤А╤В╤Г╨░╨╗╤М╨╜╤Л╨╣ ╨║╨╡╤И','C'),(85,3,'╨з╤В╨╛ ╤В╨░╨║╨╛╨╡ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤М?','╨г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛ ╨┤╨╗╤П ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨╣ ╨╛╨▒╤А╨░╨▒╨╛╤В╨║╨╕ ╨┤╨░╨╜╨╜╤Л╤Е','╨г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛ ╨┤╨╗╤П ╨┤╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╨┤╨░╨╜╨╜╤Л╤Е','╨г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛ ╨┤╨╗╤П ╨▓╤Л╨▓╨╛╨┤╨░ ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╨╕','╨г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛ ╨┤╨╗╤П ╨╛╤Е╨╗╨░╨╢╨┤╨╡╨╜╨╕╤П','B'),(86,3,'╨Ъ╨░╨║╨╛╨╣ ╤В╨╕╨┐ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤П ╨╜╨╡ ╨╕╨╝╨╡╨╡╤В ╨┤╨▓╨╕╨╢╤Г╤Й╨╕╤Е╤Б╤П ╤З╨░╤Б╤В╨╡╨╣?','HDD','CD-ROM','SSD','DVD','C'),(87,3,'╨Э╨░ ╤З╤С╨╝ ╨╛╤Б╨╜╨╛╨▓╨░╨╜ ╨┐╤А╨╕╨╜╤Ж╨╕╨┐ ╤А╨░╨▒╨╛╤В╤Л HDD?','╨Э╨░ ╨╛╨┐╤В╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨╖╨░╨┐╨╕╤Б╨╕','╨Э╨░ ╨╝╨░╨│╨╜╨╕╤В╨╜╨╛╨╣ ╨╖╨░╨┐╨╕╤Б╨╕ ╨╜╨░ ╨▓╤А╨░╤Й╨░╤О╤Й╨╕╨╡╤Б╤П ╨┐╨╗╨░╤Б╤В╨╕╨╜╤Л','╨Э╨░ ╤Н╨╗╨╡╨║╤В╤А╨╕╤З╨╡╤Б╨║╨╛╨╣ ╨╖╨░╨┐╨╕╤Б╨╕','╨Э╨░ ╨╗╨░╨╖╨╡╤А╨╜╨╛╨╣ ╨╖╨░╨┐╨╕╤Б╨╕','B'),(88,3,'╨Ъ╨░╨║╨╛╨╣ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╤М ╨╕╨╝╨╡╨╡╤В ╨╜╨░╨╕╨▒╨╛╨╗╤М╤И╤Г╤О ╤С╨╝╨║╨╛╤Б╤В╤М ╨▓ ╨╜╨░╤Б╤В╨╛╤П╤Й╨╡╨╡ ╨▓╤А╨╡╨╝╤П?','USB-╤Д╨╗╨╡╤И╨║╨░','CD','HDD','SD-╨║╨░╤А╤В╨░','C'),(89,4,'╨з╤В╨╛ ╨╛╨╖╨╜╨░╤З╨░╨╡╤В ╨░╨▒╨▒╤А╨╡╨▓╨╕╨░╤В╤Г╤А╨░ RAID?','Random Access Integrated Disk','Redundant Arrays of Inexpensive Disks','Rapid Access Internal Drive','Redundant Automated Input Device','B'),(90,4,'╨з╤В╨╛ ╨┐╤А╨╛╨╕╤Б╤Е╨╛╨┤╨╕╤В ╨┐╤А╨╕ ╨╛╤В╨║╨░╨╖╨╡ ╨╛╨┤╨╜╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░ ╨▓ RAID 0?','╨Ь╨░╤Б╤Б╨╕╨▓ ╨┐╤А╨╛╨┤╨╛╨╗╨╢╨░╨╡╤В ╤А╨░╨▒╨╛╤В╨░╤В╤М','╨в╨╡╤А╤П╤О╤В╤Б╤П ╤В╨╛╨╗╤М╨║╨╛ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╜╨░ ╤Н╤В╨╛╨╝ ╨┤╨╕╤Б╨║╨╡','╨в╨╡╤А╤П╤О╤В╤Б╤П ╨▓╤Б╨╡ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╝╨░╤Б╤Б╨╕╨▓╨░','╨Э╨╕╤З╨╡╨│╨╛ ╨╜╨╡ ╨┐╤А╨╛╨╕╤Б╤Е╨╛╨┤╨╕╤В','C'),(91,4,'╨Ъ╨░╨║╨╛╨╣ ╤Г╤А╨╛╨▓╨╡╨╜╤М RAID ╨╛╨▒╨╡╤Б╨┐╨╡╤З╨╕╨▓╨░╨╡╤В ╨╖╨╡╤А╨║╨░╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡?','RAID 0','RAID 1','RAID 5','RAID 10','B'),(92,4,'╨Ъ╨░╨║╨╛╨▓╨╛ ╨│╨╗╨░╨▓╨╜╨╛╨╡ ╨┐╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨╛ RAID 0?','╨Ю╤В╨║╨░╨╖╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╤М','╨Ч╨╡╤А╨║╨░╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡ ╨┤╨░╨╜╨╜╤Л╤Е','╨Э╨░╨╕╨▓╤Л╤Б╤И╨░╤П ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╤М','╨Я╤А╨╛╤Б╤В╨╛╤В╨░ ╨▓╨╛╤Б╤Б╤В╨░╨╜╨╛╨▓╨╗╨╡╨╜╨╕╤П','C');
/*!40000 ALTER TABLE `mini_tests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `test_results`
--

DROP TABLE IF EXISTS `test_results`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `test_results` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `score` int NOT NULL,
  `total_questions` int NOT NULL,
  `percentage` decimal(5,2) NOT NULL,
  `test_type` enum('mini','full') COLLATE utf8mb4_unicode_ci NOT NULL,
  `topic_id` int DEFAULT NULL,
  `started_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `completed_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  KEY `topic_id` (`topic_id`),
  CONSTRAINT `test_results_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  CONSTRAINT `test_results_ibfk_2` FOREIGN KEY (`topic_id`) REFERENCES `theory_topics` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `test_results`
--

LOCK TABLES `test_results` WRITE;
/*!40000 ALTER TABLE `test_results` DISABLE KEYS */;
INSERT INTO `test_results` VALUES (1,2,0,4,0.00,'mini',1,'2026-05-03 21:04:28','2026-05-03 21:04:28');
/*!40000 ALTER TABLE `test_results` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `theory_topics`
--

DROP TABLE IF EXISTS `theory_topics`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `theory_topics` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `short_content` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `file_path` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `order_num` int DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `theory_topics`
--

LOCK TABLES `theory_topics` WRITE;
/*!40000 ALTER TABLE `theory_topics` DISABLE KEYS */;
INSERT INTO `theory_topics` VALUES (1,'╨в╨╡╨╝╨░ 1. ╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М','<h3>╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М (╨Ю╨Ч╨г, RAM)</h3><p>╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М тАФ ╨╛╨┤╨╕╨╜ ╨╕╨╖ ╨▓╨░╨╢╨╜╨╡╨╣╤И╨╕╤Е ╨║╨╛╨╝╨┐╨╛╨╜╨╡╨╜╤В╨╛╨▓ ╤Б╨╕╤Б╤В╨╡╨╝╤Л, ╨╜╨╡╨╛╨▒╤Е╨╛╨┤╨╕╨╝╨░ ╨┤╨╗╤П ╤А╨░╨▒╨╛╤В╤Л ╨╛╨┐╨╡╤А╨░╤Ж╨╕╨╛╨╜╨╜╨╛╨╣ ╤Б╨╕╤Б╤В╨╡╨╝╤Л ╨╕ ╨┐╤А╨╕╨╗╨╛╨╢╨╡╨╜╨╕╨╣, ╨┤╨╗╤П ╨╛╨▒╤А╨░╨▒╨╛╤В╨║╨╕ ╨╕ ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╨┤╨░╨╜╨╜╤Л╤Е. ╨Ю╨Ч╨г ╨╜╨╡ ╨┐╨╛╨╖╨▓╨╛╨╗╤П╨╡╤В ╤Е╤А╨░╨╜╨╕╤В╤М ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╤О ╨┐╨╛╤Б╨╗╨╡ ╨▓╤Л╨║╨╗╤О╤З╨╡╨╜╨╕╤П ╨┐╨╕╤В╨░╨╜╨╕╤П, ╨╜╨╛ ╤А╨░╨▒╨╛╤В╨░╨╡╤В ╨╜╨░╨╝╨╜╨╛╨│╨╛ ╨▒╤Л╤Б╤В╤А╨╡╨╡ ╨╢╨╡╤Б╤В╨║╨╕╤Е ╨┤╨╕╤Б╨║╨╛╨▓. ╨Ы╤О╨▒╨░╤П ╨┐╤А╨╛╨│╤А╨░╨╝╨╝╨░ ╤Б╨╜╨░╤З╨░╨╗╨░ ╨╖╨░╨│╤А╤Г╨╢╨░╨╡╤В╤Б╤П ╤Б ╨╢╨╡╤Б╤В╨║╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░ ╨▓ ╨╛╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╤Г╤О ╨┐╨░╨╝╤П╤В╤М ╨╕ ╨╗╨╕╤И╤М ╨╖╨░╤В╨╡╨╝ ╨╜╨░╤З╨╕╨╜╨░╨╡╤В ╤А╨░╨▒╨╛╤В╤Г.</p><h4>╨Ю╤Б╨╜╨╛╨▓╨╜╤Л╨╡ ╨┐╨╛╨╜╤П╤В╨╕╤П</h4><p>╨Ю╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М ╨╝╨╛╨╢╨╡╤В ╨╛╨▒╨╛╨╖╨╜╨░╤З╨░╤В╤М╤Б╤П ╨║╨░╨║ <strong>╨Ю╨Ч╨г</strong> (╨╛╨┐╨╡╤А╨░╤В╨╕╨▓╨╜╨╛╨╡ ╨╖╨░╨┐╨╛╨╝╨╕╨╜╨░╤О╤Й╨╡╨╡ ╤Г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨╛) ╨╕╨╗╨╕ <strong>RAM</strong> (Random Access Memory тАФ ╨┐╨░╨╝╤П╤В╤М ╤Б ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨╗╤М╨╜╤Л╨╝ ╨┤╨╛╤Б╤В╤Г╨┐╨╛╨╝). ╨Т╤Л╨┐╨╛╨╗╨╜╤П╨╡╤В╤Б╤П ╨▓ ╨▓╨╕╨┤╨╡ ╨╛╤В╨┤╨╡╨╗╤М╨╜╤Л╤Е ╨╝╨╛╨┤╤Г╨╗╨╡╨╣, ╤Б╨╛╤Б╤В╨╛╤П╤Й╨╕╤Е ╨╕╨╖ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╤Е ╤З╨╕╨┐╨╛╨▓ ╨┐╨░╨╝╤П╤В╨╕, ╨║╨╛╤В╨╛╤А╤Л╨╡ ╤Г╤Б╤В╨░╨╜╨░╨▓╨╗╨╕╨▓╨░╤О╤В╤Б╤П ╨▓ ╤Б╨╛╨╛╤В╨▓╨╡╤В╤Б╤В╨▓╤Г╤О╤Й╨╕╨╡ ╤А╨░╨╖╤К╨╡╨╝╤Л ╨╜╨░ ╤Б╨╕╤Б╤В╨╡╨╝╨╜╨╛╨╣ ╨┐╨╗╨░╤В╨╡.</p><h4>╨Ю╤А╨│╨░╨╜╨╕╨╖╨░╤Ж╨╕╤П ╤З╨╕╨┐╨╛╨▓ ╨┐╨░╨╝╤П╤В╨╕</h4><p>╨Ъ╨░╨╢╨┤╤Л╨╣ ╤З╨╕╨┐ ╨┐╨░╨╝╤П╤В╨╕ тАФ ╤Н╤В╨╛ ╨╝╨░╤В╤А╨╕╤Ж╨░ ╨╕╨╖ ╨╝╨╕╨╗╨╗╨╕╨╛╨╜╨╛╨▓ ╨╝╨╕╨╜╨╕╨░╤В╤О╤А╨╜╤Л╤Е ╨║╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╨╛╨▓, ╤П╨▓╨╗╤П╤О╤Й╨╕╤Е╤Б╤П ╤Н╨╗╨╡╨╝╨╡╨╜╤В╨░╤А╨╜╤Л╨╝╨╕ ╤П╤З╨╡╨╣╨║╨░╨╝╨╕ ╨┐╨░╨╝╤П╤В╨╕. ╨Ъ╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╤Л ╨╝╨╛╨│╤Г╤В ╨╜╨░╤Е╨╛╨┤╨╕╤В╤М╤Б╤П ╨▓ ╨╖╨░╤А╤П╨╢╨╡╨╜╨╜╨╛╨╝ (1) ╨╕╨╗╨╕ ╤А╨░╨╖╤А╤П╨╢╨╡╨╜╨╜╨╛╨╝ (0) ╤Б╨╛╤Б╤В╨╛╤П╨╜╨╕╨╕. ╨Ъ╤А╨╛╨╝╨╡ ╨║╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╨╛╨▓, ╤З╨╕╨┐ ╤Б╨╛╨┤╨╡╤А╨╢╨╕╤В ╤Б╤Е╨╡╨╝╤Л ╤Г╨┐╤А╨░╨▓╨╗╨╡╨╜╨╕╤П ╤З╤В╨╡╨╜╨╕╨╡╨╝, ╨╖╨░╨┐╨╕╤Б╤М╤О ╨╕ <strong>╤А╨╡╨│╨╡╨╜╨╡╤А╨░╤Ж╨╕╨╡╨╣ ╨┤╨░╨╜╨╜╤Л╤Е</strong> тАФ ╨┤╨╗╤П ╨▓╨╛╤Б╤Б╤В╨░╨╜╨╛╨▓╨╗╨╡╨╜╨╕╤П ╨╖╨░╤А╤П╨┤╨░ ╨║╨╛╨╜╨┤╨╡╨╜╤Б╨░╤В╨╛╤А╨╛╨▓, ╨┐╨╛╤Б╨║╨╛╨╗╤М╨║╤Г ╤Б╨╛ ╨▓╤А╨╡╨╝╨╡╨╜╨╡╨╝ ╨╛╨╜╨╕ ╤Б╨░╨╝╨╛╨┐╤А╨╛╨╕╨╖╨▓╨╛╨╗╤М╨╜╨╛ ╤А╨░╨╖╤А╤П╨╢╨░╤О╤В╤Б╤П.</p><h4>╨С╨╗╨╛╤З╨╜╨░╤П ╨╛╤А╨│╨░╨╜╨╕╨╖╨░╤Ж╨╕╤П ╨┐╨░╨╝╤П╤В╨╕</h4><p>╨Х╨╝╨║╨╛╤Б╤В╤М ╨╛╤Б╨╜╨╛╨▓╨╜╨╛╨╣ ╨┐╨░╨╝╤П╤В╨╕ ╤Б╨╗╨╕╤И╨║╨╛╨╝ ╨▓╨╡╨╗╨╕╨║╨░ ╨┤╨╗╤П ╤А╨╡╨░╨╗╨╕╨╖╨░╤Ж╨╕╨╕ ╨╜╨░ ╨╛╨┤╨╜╨╛╨╣ ╨Ш╨Ь╨б. ╨Э╨╡╨╛╨▒╤Е╨╛╨┤╨╕╨╝╨╛╤Б╤В╤М ╨╛╨▒╤К╨╡╨┤╨╕╨╜╨╡╨╜╨╕╤П ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╤Е ╨Ш╨Ь╨б ╨Ч╨г ╨▓╨╛╨╖╨╜╨╕╨║╨░╨╡╤В, ╨║╨╛╨│╨┤╨░ ╤А╨░╨╖╤А╤П╨┤╨╜╨╛╤Б╤В╤М ╤П╤З╨╡╨╡╨║ ╨╝╨╡╨╜╤М╤И╨╡ ╤А╨░╨╖╤А╤П╨┤╨╜╨╛╤Б╤В╨╕ ╤Б╨╗╨╛╨▓ ╨Т╨Ь. ╨г╨▓╨╡╨╗╨╕╤З╨╡╨╜╨╕╨╡ ╤А╨░╨╖╤А╤П╨┤╨╜╨╛╤Б╤В╨╕ ╤А╨╡╨░╨╗╨╕╨╖╤Г╨╡╤В╤Б╤П ╨╖╨░ ╤Б╤З╨╡╤В ╨╛╨▒╤К╨╡╨┤╨╕╨╜╨╡╨╜╨╕╤П ╨░╨┤╤А╨╡╤Б╨╜╤Л╤Е ╨▓╤Е╨╛╨┤╨╛╨▓ ╨Ш╨Ь╨б ╨Ч╨г. ╨Я╨╛╨╗╤Г╤З╨╡╨╜╨╜╤Г╤О ╤Б╨╛╨▓╨╛╨║╤Г╨┐╨╜╨╛╤Б╤В╤М ╨╝╨╕╨║╤А╨╛╤Б╤Е╨╡╨╝ ╨╜╨░╨╖╤Л╨▓╨░╤О╤В <strong>╨╝╨╛╨┤╤Г╨╗╨╡╨╝ ╨┐╨░╨╝╤П╤В╨╕</strong>. ╨Ю╨┤╨╕╨╜ ╨╕╨╗╨╕ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╛ ╨╝╨╛╨┤╤Г╨╗╨╡╨╣ ╨╛╨▒╤А╨░╨╖╤Г╤О╤В <strong>╨▒╨░╨╜╨║ ╨┐╨░╨╝╤П╤В╨╕</strong>.</p><h4>╨а╨░╤Б╤Б╨╗╨╛╨╡╨╜╨╕╨╡ ╨┐╨░╨╝╤П╤В╨╕</h4><p>╨С╨╗╨╛╤З╨╜╨╛╨╡ ╨┐╨╛╤Б╤В╤А╨╛╨╡╨╜╨╕╨╡ ╨┐╨░╨╝╤П╤В╨╕ ╨┐╨╛╨╖╨▓╨╛╨╗╤П╨╡╤В ╤Б╨╛╨║╤А╨░╤В╨╕╤В╤М ╨▓╤А╨╡╨╝╤П ╨┤╨╛╤Б╤В╤Г╨┐╨░ ╨▒╨╗╨░╨│╨╛╨┤╨░╤А╤П ╨┐╨╛╤В╨╡╨╜╤Ж╨╕╨░╨╗╤М╨╜╨╛╨╝╤Г ╨┐╨░╤А╨░╨╗╨╗╨╡╨╗╨╕╨╖╨╝╤Г. ╨С╨╛╨╗╤М╤И╨╡╨╣ ╤Б╨║╨╛╤А╨╛╤Б╤В╨╕ ╨┤╨╛╤Б╤В╤Г╨┐╨░ ╨╝╨╛╨╢╨╜╨╛ ╨┤╨╛╤Б╤В╨╕╤З╤М ╨╖╨░ ╤Б╤З╨╡╤В ╨╛╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╨┤╨╛╤Б╤В╤Г╨┐╨░ ╨║╨╛ ╨╝╨╜╨╛╨│╨╕╨╝ ╨▒╨░╨╜╨║╨░╨╝ ╨┐╨░╨╝╤П╤В╨╕. ╨Ь╨╡╤В╨╛╨┤╨╕╨║╨░ ╨╜╨░╨╖╤Л╨▓╨░╨╡╤В╤Б╤П <strong>╤А╨░╤Б╤Б╨╗╨╛╨╡╨╜╨╕╨╡╨╝ ╨┐╨░╨╝╤П╤В╨╕</strong>. ╨Т ╨╡╤С ╨╛╤Б╨╜╨╛╨▓╨╡ тАФ <strong>╤З╨╡╤А╨╡╨┤╨╛╨▓╨░╨╜╨╕╨╡ ╨░╨┤╤А╨╡╤Б╨╛╨▓</strong> (address interleaving), ╨╖╨░╨║╨╗╤О╤З╨░╤О╤Й╨╡╨╡╤Б╤П ╨▓ ╨╕╨╖╨╝╨╡╨╜╨╡╨╜╨╕╨╕ ╤Б╨╕╤Б╤В╨╡╨╝╤Л ╤А╨░╤Б╨┐╤А╨╡╨┤╨╡╨╗╨╡╨╜╨╕╤П ╨░╨┤╤А╨╡╤Б╨╛╨▓ ╨╝╨╡╨╢╨┤╤Г ╨▒╨░╨╜╨║╨░╨╝╨╕ ╨┐╨░╨╝╤П╤В╨╕.</p><h4>╨Ю╤А╨│╨░╨╜╨╕╨╖╨░╤Ж╨╕╤П ╨╝╨╕╨║╤А╨╛╤Б╤Е╨╡╨╝ ╨┐╨░╨╝╤П╤В╨╕</h4><p>╨Ш╨Ь╨б ╨┐╨░╨╝╤П╤В╨╕ ╨╛╤А╨│╨░╨╜╨╕╨╖╨╛╨▓╨░╨╜╤Л ╨▓ ╨▓╨╕╨┤╨╡ ╨╝╨░╤В╤А╨╕╤Ж╤Л ╤П╤З╨╡╨╡╨║. ╨Ъ╨░╨╢╨┤╤Л╨╣ ╨╖╨░╨┐╨╛╨╝╨╕╨╜╨░╤О╤Й╨╕╨╣ ╤Н╨╗╨╡╨╝╨╡╨╜╤В (╨Ч╨н) ╤Б╨┐╨╛╤Б╨╛╨▒╨╡╨╜ ╤Е╤А╨░╨╜╨╕╤В╤М ╨╛╨┤╨╕╨╜ ╨▒╨╕╤В ╨╕ ╨╕╨╝╨╡╨╡╤В ╨┤╨▓╨░ ╤Б╤В╨░╨▒╨╕╨╗╤М╨╜╤Л╤Е ╤Б╨╛╤Б╤В╨╛╤П╨╜╨╕╤П (0 ╨╕ 1). ╨а╨╡╨░╨╗╨╕╨╖╤Г╨╡╤В╤Б╤П <strong>╨║╨╛╨╛╤А╨┤╨╕╨╜╨░╤В╨╜╤Л╨╣ ╨┐╤А╨╕╨╜╤Ж╨╕╨┐ ╨░╨┤╤А╨╡╤Б╨░╤Ж╨╕╨╕</strong>: ╨░╨┤╤А╨╡╤Б ╤А╨░╨╖╨┤╨╡╨╗╤П╨╡╤В╤Б╤П ╨╜╨░ ╨░╨┤╤А╨╡╤Б ╤Б╤В╤А╨╛╨║╨╕ ╨╕ ╨░╨┤╤А╨╡╤Б ╤Б╤В╨╛╨╗╨▒╤Ж╨░. ╨Ч╨░╨┐╨╛╨╝╨╕╨╜╨░╤О╤Й╨╕╨╡ ╤Н╨╗╨╡╨╝╨╡╨╜╤В╤Л ╨╜╨░ ╨┐╨╡╤А╨╡╤Б╨╡╤З╨╡╨╜╨╕╨╕ ╨│╨╛╤А╨╕╨╖╨╛╨╜╤В╨░╨╗╤М╨╜╨╛╨╣ ╨╕ ╨▓╨╡╤А╤В╨╕╨║╨░╨╗╤М╨╜╨╛╨╣ ╨╗╨╕╨╜╨╕╨╕ ╨╛╨▒╤А╨░╨╖╤Г╤О╤В <strong>╤Б╤В╤А╨╛╨║╤Г (row)</strong> ╨╕ <strong>╤Б╤В╨╛╨╗╨▒╨╡╤Ж (column)</strong>. ╨б╨╛╨▓╨╛╨║╤Г╨┐╨╜╨╛╤Б╤В╤М ╨Ч╨н ╨╕ ╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╤Е ╤Б╤Е╨╡╨╝ ╨▓╤Л╨▒╨╛╤А╨░ ╨╜╨░╨╖╤Л╨▓╨░╤О╤В <strong>╤П╨┤╤А╨╛╨╝ ╨╝╨╕╨║╤А╨╛╤Б╤Е╨╡╨╝╤Л ╨┐╨░╨╝╤П╤В╨╕</strong>.',NULL,1),(2,'╨в╨╡╨╝╨░ 2. ╨Ъ╨╡╤И-╨┐╨░╨╝╤П╤В╤М','<h3>╨Ъ╨╡╤И-╨┐╨░╨╝╤П╤В╤М (Cache Memory)</h3><p>╨Ъ╨╡╤И-╨┐╨░╨╝╤П╤В╤М тАФ ╤Н╤В╨╛ ╨▓╤Л╤Б╨╛╨║╨╛╤Б╨║╨╛╤А╨╛╤Б╤В╨╜╨░╤П ╨┐╨░╨╝╤П╤В╤М ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨╗╤М╨╜╨╛╨│╨╛ ╨┤╨╛╤Б╤В╤Г╨┐╨░, ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╨░╤П ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╨╛╨╝ ╨║╨╛╨╝╨┐╤М╤О╤В╨╡╤А╨░ ╨┤╨╗╤П ╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╨╕. ╨Ю╨╜╨░ ╤Г╨▓╨╡╨╗╨╕╤З╨╕╨▓╨░╨╡╤В ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╤М, ╨┐╨╛╤Б╨║╨╛╨╗╤М╨║╤Г ╤Е╤А╨░╨╜╨╕╤В ╨╜╨░╨╕╨▒╨╛╨╗╨╡╨╡ ╤З╨░╤Б╤В╨╛ ╨╕╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╨╝╤Л╨╡ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╕ ╨║╨╛╨╝╨░╨╜╨┤╤Л ┬л╨▒╨╗╨╕╨╢╨╡┬╗ ╨║ ╨┐╤А╨╛╤Ж╨╡╤Б╤Б╨╛╤А╤Г, ╨╛╤В╨║╤Г╨┤╨░ ╨╕╤Е ╨╝╨╛╨╢╨╜╨╛ ╨▒╤Л╤Б╤В╤А╨╡╨╡ ╨┐╨╛╨╗╤Г╤З╨╕╤В╤М.</p><h4>╨Ь╨╡╤В╨╛╨┤╤Л ╨╖╨░╨┐╨╕╤Б╨╕ ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╨╕ ╨▓ ╨║╨╡╤И</h4><ul><li><strong>Write-back (╨╛╨▒╤А╨░╤В╨╜╨░╤П ╨╖╨░╨┐╨╕╤Б╤М)</strong> тАФ ╨╖╨░╨┐╨╕╤Б╤М ╨┤╨░╨╜╨╜╤Л╤Е ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╤Б╤П ╤Б╨╜╨░╤З╨░╨╗╨░ ╨▓ ╨║╨╡╤И, ╨░ ╨╖╨░╤В╨╡╨╝, ╨┐╤А╨╕ ╨╜╨░╤Б╤В╤Г╨┐╨╗╨╡╨╜╨╕╨╕ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╤Е ╤Г╤Б╨╗╨╛╨▓╨╕╨╣, ╨╕ ╨▓ ╨Ю╨Ч╨г.</li><li><strong>Write-through (╤Б╨║╨▓╨╛╨╖╨╜╨░╤П ╨╖╨░╨┐╨╕╤Б╤М)</strong> тАФ ╨╖╨░╨┐╨╕╤Б╤М ╨┤╨░╨╜╨╜╤Л╤Е ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╤Б╤П ╨╛╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛ ╨▓ ╨Ю╨Ч╨г ╨╕ ╨▓ ╨║╨╡╤И.</li></ul><h4>╨Р╤А╤Е╨╕╤В╨╡╨║╤В╤Г╤А╨░ ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╨╛╤Б╤В╨╕ ╨║╤Н╤И╨╕╤А╨╛╨▓╨░╨╜╨╕╤П</h4><ul><li><strong>╨Ъ╨╡╤И ╤Б ╨┐╤А╤П╨╝╤Л╨╝ ╨╛╤В╨╛╨▒╤А╨░╨╢╨╡╨╜╨╕╨╡╨╝</strong> тАФ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╛╤В╨▓╨╡╤З╨░╨╡╤В ╨╖╨░ ╨╛╨┐╤А╨╡╨┤╨╡╨╗╤С╨╜╨╜╤Л╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨Ю╨Ч╨г.</li><li><strong>╨Я╨╛╨╗╨╜╨╛╤Б╤В╤М╤О ╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣ ╨║╨╡╤И</strong> тАФ ╨╗╤О╨▒╨╛╨╣ ╤Г╤З╨░╤Б╤В╨╛╨║ ╨║╨╡╤И╨░ ╨╝╨╛╨╢╨╡╤В ╨░╤Б╤Б╨╛╤Ж╨╕╨╕╤А╨╛╨▓╨░╤В╤М╤Б╤П ╤Б ╨╗╤О╨▒╤Л╨╝ ╤Г╤З╨░╤Б╤В╨║╨╛╨╝ ╨Ю╨Ч╨г.</li><li><strong>╨б╨╝╨╡╤И╨░╨╜╨╜╤Л╨╣ ╨║╨╡╤И (╨╜╨░╨▒╨╛╤А╨╜╨╛-╨░╤Б╤Б╨╛╤Ж╨╕╨░╤В╨╕╨▓╨╜╤Л╨╣)</strong> тАФ ╨║╨╛╨╝╨┐╤А╨╛╨╝╨╕╤Б╤Б╨╜╤Л╨╣ ╨▓╨░╤А╨╕╨░╨╜╤В: ╨║╨╡╤И ╤А╨░╨╖╨┤╨╡╨╗╤С╨╜ ╨╜╨░ ╨╜╨░╨▒╨╛╤А╤Л (sets), ╨╕ ╨┤╨░╨╜╨╜╤Л╨╡ ╨╝╨╛╨│╤Г╤В ╤А╨░╨╖╨╝╨╡╤Й╨░╤В╤М╤Б╤П ╨▓ ╨╗╤О╨▒╨╛╨╝ ╤Б╨╗╨╛╤В╨╡ ╨▓╨╜╤Г╤В╤А╨╕ ╤Б╨▓╨╛╨╡╨│╨╛ ╨╜╨░╨▒╨╛╤А╨░.</li></ul>',NULL,2),(3,'╨в╨╡╨╝╨░ 3. ╨Э╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╨╕','<h3>╨Э╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╨╕ (Storage Devices)</h3><p>╨Э╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╨╕ тАФ ╤Г╤Б╤В╤А╨╛╨╣╤Б╤В╨▓╨░ ╨┤╨╗╤П ╨┤╨╛╨╗╨│╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛╨│╨╛ ╤Е╤А╨░╨╜╨╡╨╜╨╕╤П ╨┤╨░╨╜╨╜╤Л╤Е. ╨Т╨║╨╗╤О╤З╨░╤О╤В ╨╢╤С╤Б╤В╨║╨╕╨╡ ╨┤╨╕╤Б╨║╨╕ (HDD), ╤В╨▓╨╡╤А╨┤╨╛╤В╨╡╨╗╤М╨╜╤Л╨╡ ╨╜╨░╨║╨╛╨┐╨╕╤В╨╡╨╗╨╕ (SSD), ╨╛╨┐╤В╨╕╤З╨╡╤Б╨║╨╕╨╡ ╨┤╨╕╤Б╨║╨╕ ╨╕ ╨┤╤А╤Г╨│╨╕╨╡ ╨╜╨╛╤Б╨╕╤В╨╡╨╗╨╕.</p><p><em>╨Ь╨░╤В╨╡╤А╨╕╨░╨╗ ╨┤╨░╨╜╨╜╨╛╨╣ ╤В╨╡╨╝╤Л ╨▒╤Г╨┤╨╡╤В ╨┤╨╛╨┐╨╛╨╗╨╜╨╡╨╜. ╨Ф╨╗╤П ╨┐╨╛╨╗╨╜╨╛╨│╨╛ ╤В╨╡╨║╤Б╤В╨░ ╤Б╨║╨░╤З╨░╨╣╤В╨╡ ╤Д╨░╨╣╨╗ ╨╗╨╡╨║╤Ж╨╕╨╣ ╨╜╨╕╨╢╨╡.</em></p>',NULL,3),(4,'╨в╨╡╨╝╨░ 4. ╨б╨╕╤Б╤В╨╡╨╝╤Л RAID','<h3>╨б╨╕╤Б╤В╨╡╨╝╤Л RAID</h3><p>RAID (Redundant Arrays of Inexpensive Disks тАФ ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╤Л╨╣ ╨╝╨░╤Б╤Б╨╕╨▓ ╨╜╨╡╨┤╨╛╤А╨╛╨│╨╕╤Е ╨┤╨╕╤Б╨║╨╛╨▓) тАФ ╤В╨╡╤Е╨╜╨╛╨╗╨╛╨│╨╕╤П ╨╛╨▒╤К╨╡╨┤╨╕╨╜╨╡╨╜╨╕╤П ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╤Е ╨┤╨╕╤Б╨║╨╛╨▓ ╨▓ ╨╛╨┤╨╕╨╜ ╨╗╨╛╨│╨╕╤З╨╡╤Б╨║╨╕╨╣ ╨╝╨░╤Б╤Б╨╕╨▓ ╨┤╨╗╤П ╨┐╨╛╨▓╤Л╤И╨╡╨╜╨╕╤П ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╨╕, ╨╜╨░╨┤╤С╨╢╨╜╨╛╤Б╤В╨╕ ╨╕╨╗╨╕ ╤В╨╛╨│╨╛ ╨╕ ╨┤╤А╤Г╨│╨╛╨│╨╛ ╨╛╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛. ╨Т╨┐╨╡╤А╨▓╤Л╨╡ ╨┐╤А╨╡╨┤╤Б╤В╨░╨▓╨╗╨╡╨╜╨░ ╨╕╤Б╤Б╨╗╨╡╨┤╨╛╨▓╨░╤В╨╡╨╗╤П╨╝╨╕ (╨Я╨░╤В╤В╨╡╤А╤Б╨╛╨╜, ╨У╨╕╨▒╤Б╨╛╨╜ ╨╕ ╨Ъ╨░╤Ж) ╨╕╨╖ ╨Ъ╨░╨╗╨╕╤Д╨╛╤А╨╜╨╕╨╣╤Б╨║╨╛╨│╨╛ ╤Г╨╜╨╕╨▓╨╡╤А╤Б╨╕╤В╨╡╤В╨░ ╨▓ ╨С╨╡╤А╨║╨╗╨╕ ╨▓ 1987 ╨│╨╛╨┤╤Г.</p><h4>RAID 0 тАФ ╨Ф╨╕╤Б╨║╨╛╨▓╤Л╨╣ ╨╝╨░╤Б╤Б╨╕╨▓ ╨▒╨╡╨╖ ╨╛╤В╨║╨░╨╖╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓╨╛╤Б╤В╨╕ (Striping)</h4><p>╨Ф╨░╨╜╨╜╤Л╨╡ ╤А╨░╨╖╨▒╨╕╨▓╨░╤О╤В╤Б╤П ╨╜╨░ ╨▒╨╗╨╛╨║╨╕, ╨║╨░╨╢╨┤╤Л╨╣ ╨▒╨╗╨╛╨║ ╨╖╨░╨┐╨╕╤Б╤Л╨▓╨░╨╡╤В╤Б╤П ╨╜╨░ ╨╛╤В╨┤╨╡╨╗╤М╨╜╤Л╨╣ ╨┤╨╕╤Б╨║. ╨Э╨╡╤Б╨║╨╛╨╗╤М╨║╨╛ ╨╛╨┐╨╡╤А╨░╤Ж╨╕╨╣ ╨▓╨▓╨╛╨┤╨░-╨▓╤Л╨▓╨╛╨┤╨░ ╨▓╤Л╨┐╨╛╨╗╨╜╤П╤О╤В╤Б╤П ╨╛╨┤╨╜╨╛╨▓╤А╨╡╨╝╨╡╨╜╨╜╨╛.</p><ul><li><strong>╨Я╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨░:</strong> ╨╜╨░╨╕╨▓╤Л╤Б╤И╨░╤П ╨┐╤А╨╛╨╕╨╖╨▓╨╛╨┤╨╕╤В╨╡╨╗╤М╨╜╨╛╤Б╤В╤М; ╨┐╤А╨╛╤Б╤В╨╛╤В╨░ ╤А╨╡╨░╨╗╨╕╨╖╨░╤Ж╨╕╨╕; ╨╜╨╕╨╖╨║╨░╤П ╤Б╤В╨╛╨╕╨╝╨╛╤Б╤В╤М ╨╜╨░ ╨╡╨┤╨╕╨╜╨╕╤Ж╤Г ╨╛╨▒╤К╤С╨╝╨░.</li><li><strong>╨Э╨╡╨┤╨╛╤Б╤В╨░╤В╨║╨╕:</strong> ╨╜╨╡ ╨╛╤В╨║╨░╨╖╨╛╤Г╤Б╤В╨╛╨╣╤З╨╕╨▓; ╨╛╤В╨║╨░╨╖ ╨╛╨┤╨╜╨╛╨│╨╛ ╨┤╨╕╤Б╨║╨░ = ╨┐╨╛╤В╨╡╤А╤П ╨▓╤Б╨╡╤Е ╨┤╨░╨╜╨╜╤Л╤Е ╨╝╨░╤Б╤Б╨╕╨▓╨░.</li></ul><h4>RAID 1 тАФ ╨Ч╨╡╤А╨║╨░╨╗╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡ (Mirroring)</h4><p>╨Ш╤Б╨┐╨╛╨╗╤М╨╖╤Г╨╡╤В╤Б╤П ╨┤╨▓╨░ ╨┤╨╕╤Б╨║╨░, ╨╜╨░ ╨║╨╛╤В╨╛╤А╤Л╨╡ ╨╖╨░╨┐╨╕╤Б╤Л╨▓╨░╨╡╤В╤Б╤П ╨╛╨┤╨╕╨╜╨░╨║╨╛╨▓╨░╤П ╨╕╨╜╤Д╨╛╤А╨╝╨░╤Ж╨╕╤П. ╨Я╤А╨╕ ╨╛╤В╨║╨░╨╖╨╡ ╨╛╨┤╨╜╨╛╨│╨╛ ╨╛╤Б╤В╨░╤С╤В╤Б╤П ╤А╨░╨▒╨╛╤З╨╕╨╣ ╨┤╤Г╨▒╨╗╤М.</p><ul><li><strong>╨Я╤А╨╡╨╕╨╝╤Г╤Й╨╡╤Б╤В╨▓╨░:</strong> ╨┐╤А╨╛╤Б╤В╨╛╤В╨░ ╤А╨╡╨░╨╗╨╕╨╖╨░╤Ж╨╕╨╕; ╨┐╤А╨╛╤Б╤В╨╛╤В╨░ ╨▓╨╛╤Б╤Б╤В╨░╨╜╨╛╨▓╨╗╨╡╨╜╨╕╤П (╨║╨╛╨┐╨╕╤А╨╛╨▓╨░╨╜╨╕╨╡); ╨▓╤Л╤Б╨╛╨║╨╛╨╡ ╨▒╤Л╤Б╤В╤А╨╛╨┤╨╡╨╣╤Б╤В╨▓╨╕╨╡ ╨┐╤А╨╕ ╤З╤В╨╡╨╜╨╕╨╕.</li><li><strong>╨Э╨╡╨┤╨╛╤Б╤В╨░╤В╨║╨╕:</strong> ╨▓╤Л╤Б╨╛╨║╨░╤П ╤Б╤В╨╛╨╕╨╝╨╛╤Б╤В╤М (100% ╨╕╨╖╨▒╤Л╤В╨╛╤З╨╜╨╛╤Б╤В╤М); ╨╜╨╡╨▓╤Л╤Б╨╛╨║╨░╤П ╤Б╨║╨╛╤А╨╛╤Б╤В╤М ╨╖╨░╨┐╨╕╤Б╨╕.</li></ul><h4>╨Р╤А╤Е╨╕╤В╨╡╨║╤В╤Г╤А╨░ RAID</h4><p>╨а╨░╤Б╤Б╨╝╨╛╤В╤А╨╕╨╝ N ╨┤╨╕╤Б╨║╨╛╨▓ (N тАФ ╤З╤С╤В╨╜╨╛╨╡ ╤З╨╕╤Б╨╗╨╛), ╨║╨░╨╢╨┤╤Л╨╣ ╨╕╨╖ M ╨▒╨╗╨╛╨║╨╛╨▓. ╨Ф╨╕╤Б╨║╨╕ ╨╝╨╛╨│╤Г╤В ╨┐╨╛╨┤╨║╨╗╤О╤З╨░╤В╤М╤Б╤П ╨║ ╨╛╨┤╨╜╨╛╨╝╤Г ╨╕╨╗╨╕ ╨╜╨╡╤Б╨║╨╛╨╗╤М╨║╨╕╨╝ ╨║╨░╨╜╨░╨╗╨░╨╝ ╨┐╨╡╤А╨╡╨┤╨░╤З╨╕ ╨┤╨░╨╜╨╜╤Л╤Е. ╨Ш╤Б╨┐╨╛╨╗╤М╨╖╨╛╨▓╨░╨╜╨╕╨╡ ╨▒╨╛╨╗╤М╤И╨╡╨│╨╛ ╨║╨╛╨╗╨╕╤З╨╡╤Б╤В╨▓╨░ ╨║╨░╨╜╨░╨╗╨╛╨▓ ╤Г╨▓╨╡╨╗╨╕╤З╨╕╨▓╨░╨╡╤В ╨┐╤А╨╛╨┐╤Г╤Б╨║╨╜╤Г╤О ╤Б╨┐╨╛╤Б╨╛╨▒╨╜╨╛╤Б╤В╤М ╤Б╨╕╤Б╤В╨╡╨╝╤Л.</p>',NULL,4);
/*!40000 ALTER TABLE `theory_topics` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `role` enum('student','teacher') COLLATE utf8mb4_unicode_ci NOT NULL,
  `first_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `middle_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `group_id` int DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  KEY `group_id` (`group_id`),
  CONSTRAINT `users_ibfk_1` FOREIGN KEY (`group_id`) REFERENCES `groups` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','$2b$10$r8SFbyuA.XcZWY3OVBSi5u529XjXPrTEWSPreX0QSJlZ4o/MP0L5O','teacher','╨Р╨┤╨╝╨╕╨╜╨╕╤Б╤В╤А╨░╤В╨╛╤А','╨Я╤А╨╡╨┐╨╛╨┤╨░╨▓╨░╤В╨╡╨╗╤М','╨У╨╗╨░╨▓╨╜╤Л╨╣',NULL,'2026-05-03 18:48:31'),(2,'ivanov1','$2b$10$fmOJvz2QeHeNB1fk9//4eu4DHFbOpYGmHYOGmhFjAauq.77dkR5Cq','student','╨Ш╨▓╨░╨╜','╨Ш╨▓╨░╨╜╨╛╨▓','╨Ш╨▓╨░╨╜╨╛╨▓╨╕╤З',1,'2026-05-03 18:48:32'),(3,'petrov1','$2b$10$fmOJvz2QeHeNB1fk9//4eu4DHFbOpYGmHYOGmhFjAauq.77dkR5Cq','student','╨Я╤С╤В╤А','╨Я╨╡╤В╤А╨╛╨▓','╨Я╨╡╤В╤А╨╛╨▓╨╕╤З',1,'2026-05-03 18:48:32'),(4,'sidorov1','$2b$10$fmOJvz2QeHeNB1fk9//4eu4DHFbOpYGmHYOGmhFjAauq.77dkR5Cq','student','╨б╨╕╨┤╨╛╤А','╨б╨╕╨┤╨╛╤А╨╛╨▓','╨б╨╕╨┤╨╛╤А╨╛╨▓╨╕╤З',2,'2026-05-03 18:48:32'),(5,'kuznetsov1','$2b$10$fmOJvz2QeHeNB1fk9//4eu4DHFbOpYGmHYOGmhFjAauq.77dkR5Cq','student','╨Ъ╤Г╨╖╤М╨╝╨░','╨Ъ╤Г╨╖╨╜╨╡╤Ж╨╛╨▓','╨Ъ╤Г╨╖╤М╨╝╨╕╤З',3,'2026-05-03 18:48:32'),(6,'popov1','$2b$10$fmOJvz2QeHeNB1fk9//4eu4DHFbOpYGmHYOGmhFjAauq.77dkR5Cq','student','╨Я╨╛╨┐','╨Я╨╛╨┐╨╛╨▓','╨Я╨╛╨┐╨╛╨▓╨╕╤З',3,'2026-05-03 18:48:32'),(7,'testuser1','$2b$10$/qP6c0yB0n0Zsx/S1XdUbO/GBLAY8yqq2668XciaT06NtEz8un4w.','student','??????','????','????????',NULL,'2026-05-03 20:11:38');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-03 21:19:56
